{
  "title": "About",
  "content": "What is a warning sound? A sharp tone? A rising siren? A distant mechanical wail? Designed to grab attention, interrupt, alert — it may seem universal. But the sound of warning is not the same everywhere, nor has it remained the same over time. What counts as a warning depends on where you are, when you are there, and how your society has chosen to communicate danger. It differs across regions, evolves over time, and reflects specific cultural, historical, and technological circumstances. The Soundscapes of Warning application explores alarm signals as cultural artefacts and part of our shared sound heritage. Developed as part of the larger Soundscapes of Warning research project - in collaboration with the Centre for Contemporary and Digital History (C²DH) at the University of Luxembourg - the application provides a space for investigating how public warnings are designed, how they differ across nations and regions, and what they reveal about the societies that produce them. It responds to ongoing calls in sound and media studies to reimagine the cultural significance of sirens, but more centrally, it challenges the illusion of warning sounds as natural or self-evident. It foregrounds their role as historically constructed media forms.\n \n To approach these sounds as historical and aesthetic objects, the application combines contextual comparison with designed modes of visualization. Users can navigate a range of sirens from different countries and contexts, gaining insight into how ideas of urgency, danger, and public communication have been shaped by cultural and political context. Each recording is translated into a custom-designed 3D object that reflects its sonic character, capturing qualities such as rhythm, pitch, duration, and intensity. These visual forms offer a new way of perceiving warning sounds, making their structure and stylistic features available to reflection and comparison. By combining geographic variation with aesthetic interpretation, the application creates a space where alarm signals can be understood not just as functional alerts, but as expressions of how societies have imagined crisis and mobilized collective attention. The Soundscapes of Warning application is both a research tool and a public interface – a space for listening differently, seeing warning anew, and rethinking how sound is used to shape public life. \n \n You can find more information about the project and its team on our website: <a href=\"https://sonicwarnings.wordpress.com\" target=\"_blank\" rel=\"noopener noreferrer\">sonicwarnings.wordpress.com.</a>"
}
